Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_10_0055.txt
Running 20m test @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 2148.618ms, rate sampling interval: 11001ms
  Thread calibration: mean lat.: 1739.458ms, rate sampling interval: 8962ms
  Thread calibration: mean lat.: 1813.639ms, rate sampling interval: 10297ms
  Thread calibration: mean lat.: 1774.414ms, rate sampling interval: 9322ms
  Thread calibration: mean lat.: 1543.511ms, rate sampling interval: 9650ms
  Thread calibration: mean lat.: 1899.911ms, rate sampling interval: 10108ms
  Thread calibration: mean lat.: 1974.328ms, rate sampling interval: 9011ms
  Thread calibration: mean lat.: 1962.366ms, rate sampling interval: 9412ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   108.77ms  139.90ms 660.99ms   90.11%
    Req/Sec     5.49      0.82     7.00     99.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   57.66ms
 75.000%  150.01ms
 90.000%  241.41ms
 99.000%  660.99ms
 99.900%    1.05s 
 99.990%    2.34s 
 99.999%    2.82s 
100.000%    2.83s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.531     0.000000            1         1.00
      10.431     0.100000         5727         1.11
      12.839     0.200000        11390         1.25
      42.207     0.300000        17106         1.43
      55.871     0.400000        22778         1.67
      57.663     0.500000        28544         2.00
      58.431     0.550000        31359         2.22
      59.775     0.600000        34167         2.50
     109.567     0.650000        36987         2.86
     149.247     0.700000        40042         3.33
     150.015     0.750000        42850         4.00
     150.399     0.775000        44333         4.44
     150.783     0.800000        45600         5.00
     151.295     0.825000        46964         5.71
     152.191     0.850000        48392         6.67
     165.887     0.875000        49791         8.00
     194.175     0.887500        50501         8.89
     241.407     0.900000        51210        10.00
     397.055     0.912500        51934        11.43
     398.335     0.925000        52647        13.33
     399.103     0.937500        53525        16.00
     399.359     0.943750        53816        17.78
     399.615     0.950000        54066        20.00
     400.127     0.956250        54503        22.86
     400.895     0.962500        54858        26.67
     402.431     0.968750        55128        32.00
     413.183     0.971875        55300        35.56
     448.767     0.975000        55478        40.00
     486.143     0.978125        55657        45.71
     537.087     0.981250        55835        53.33
     574.463     0.984375        56015        64.00
     601.087     0.985938        56100        71.11
     617.983     0.987500        56189        80.00
     644.095     0.989062        56278        91.43
     672.767     0.990625        56367       106.67
     708.095     0.992188        56458       128.00
     722.943     0.992969        56500       142.22
     740.351     0.993750        56546       160.00
     758.271     0.994531        56589       182.86
     773.119     0.995313        56635       213.33
     790.527     0.996094        56679       256.00
     807.423     0.996484        56700       284.44
     831.999     0.996875        56723       320.00
     857.599     0.997266        56745       365.71
     892.415     0.997656        56767       426.67
     931.327     0.998047        56789       512.00
     950.783     0.998242        56801       568.89
     971.775     0.998437        56812       640.00
    1005.567     0.998633        56823       731.43
    1028.095     0.998828        56834       853.33
    1055.743     0.999023        56845      1024.00
    1072.127     0.999121        56850      1137.78
    1088.511     0.999219        56856      1280.00
    1113.087     0.999316        56862      1462.86
    1143.807     0.999414        56867      1706.67
    1216.511     0.999512        56873      2048.00
    1255.423     0.999561        56875      2275.56
    1378.303     0.999609        56878      2560.00
    1608.703     0.999658        56881      2925.71
    2031.615     0.999707        56884      3413.33
    2181.119     0.999756        56887      4096.00
    2185.215     0.999780        56888      4551.11
    2265.087     0.999805        56889      5120.00
    2316.287     0.999829        56891      5851.43
    2328.575     0.999854        56892      6826.67
    2338.815     0.999878        56894      8192.00
    2338.815     0.999890        56894      9102.22
    2549.759     0.999902        56895     10240.00
    2684.927     0.999915        56896     11702.86
    2684.927     0.999927        56896     13653.33
    2781.183     0.999939        56897     16384.00
    2781.183     0.999945        56897     18204.44
    2820.095     0.999951        56898     20480.00
    2820.095     0.999957        56898     23405.71
    2820.095     0.999963        56898     27306.67
    2824.191     0.999969        56899     32768.00
    2824.191     0.999973        56899     36408.89
    2824.191     0.999976        56899     40960.00
    2824.191     0.999979        56899     46811.43
    2824.191     0.999982        56899     54613.33
    2834.431     0.999985        56900     65536.00
    2834.431     1.000000        56900          inf
#[Mean    =      108.768, StdDeviation   =      139.897]
#[Max     =     2832.384, Total count    =        56900]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57430 requests in 20.00m, 16.45MB read
  Socket errors: connect 0, read 0, write 0, timeout 21199
  Non-2xx or 3xx responses: 56
Requests/sec:     47.85  
Transfer/sec:     14.03KB