Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_10_0210.txt
Running 20m test @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 2911.723ms, rate sampling interval: 10493ms
  Thread calibration: mean lat.: 2207.109ms, rate sampling interval: 9420ms
  Thread calibration: mean lat.: 2943.843ms, rate sampling interval: 11354ms
  Thread calibration: mean lat.: 2585.066ms, rate sampling interval: 11460ms
  Thread calibration: mean lat.: 2074.270ms, rate sampling interval: 9543ms
  Thread calibration: mean lat.: 2268.442ms, rate sampling interval: 9691ms
  Thread calibration: mean lat.: 2831.816ms, rate sampling interval: 10756ms
  Thread calibration: mean lat.: 2642.651ms, rate sampling interval: 9773ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   252.10ms  236.48ms   1.05s    57.73%
    Req/Sec     5.48      0.78     7.00     99.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  234.49ms
 75.000%  399.10ms
 90.000%  509.18ms
 99.000%    1.05s 
 99.900%    1.62s 
 99.990%    3.30s 
 99.999%    3.56s 
100.000%    3.69s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.351     0.000000            1         1.00
      10.271     0.100000         5711         1.11
      12.655     0.200000        11395         1.25
     149.631     0.300000        17338         1.43
     151.295     0.400000        23070         1.67
     234.495     0.500000        28520         2.00
     235.775     0.550000        31607         2.22
     236.543     0.600000        34234         2.50
     237.695     0.650000        37104         2.86
     269.567     0.700000        39855         3.33
     399.103     0.750000        42959         4.00
     400.127     0.775000        44194         4.44
     403.711     0.800000        45551         5.00
     505.855     0.825000        46991         5.71
     507.135     0.850000        48710         6.67
     507.903     0.875000        50038         8.00
     508.415     0.887500        50725         8.89
     509.183     0.900000        51428        10.00
     510.719     0.912500        51964        11.43
     556.543     0.925000        52665        13.33
     623.615     0.937500        53372        16.00
     655.359     0.943750        53730        17.78
     681.983     0.950000        54085        20.00
     714.239     0.956250        54443        22.86
     750.591     0.962500        54799        26.67
     798.719     0.968750        55151        32.00
     830.463     0.971875        55330        35.56
     864.255     0.975000        55511        40.00
     891.903     0.978125        55685        45.71
     925.695     0.981250        55863        53.33
     961.535     0.984375        56042        64.00
     980.479     0.985938        56131        71.11
     999.935     0.987500        56220        80.00
    1026.047     0.989062        56308        91.43
    1061.887     0.990625        56398       106.67
    1111.039     0.992188        56487       128.00
    1136.639     0.992969        56531       142.22
    1158.143     0.993750        56575       160.00
    1196.031     0.994531        56619       182.86
    1248.255     0.995313        56664       213.33
    1285.119     0.996094        56708       256.00
    1305.599     0.996484        56731       284.44
    1327.103     0.996875        56753       320.00
    1354.751     0.997266        56775       365.71
    1384.447     0.997656        56799       426.67
    1437.695     0.998047        56819       512.00
    1456.127     0.998242        56830       568.89
    1485.823     0.998437        56842       640.00
    1521.663     0.998633        56853       731.43
    1586.175     0.998828        56864       853.33
    1631.231     0.999023        56875      1024.00
    1666.047     0.999121        56880      1137.78
    1707.007     0.999219        56886      1280.00
    1755.135     0.999316        56893      1462.86
    1795.071     0.999414        56897      1706.67
    1858.559     0.999512        56903      2048.00
    1944.575     0.999561        56905      2275.56
    2014.207     0.999609        56908      2560.00
    2070.527     0.999658        56911      2925.71
    2183.167     0.999707        56914      3413.33
    2318.335     0.999756        56917      4096.00
    2396.159     0.999780        56918      4551.11
    2478.079     0.999805        56919      5120.00
    2883.583     0.999829        56921      5851.43
    3086.335     0.999854        56922      6826.67
    3303.423     0.999878        56924      8192.00
    3303.423     0.999890        56924      9102.22
    3315.711     0.999902        56925     10240.00
    3350.527     0.999915        56926     11702.86
    3350.527     0.999927        56926     13653.33
    3360.767     0.999939        56927     16384.00
    3360.767     0.999945        56927     18204.44
    3426.303     0.999951        56928     20480.00
    3426.303     0.999957        56928     23405.71
    3426.303     0.999963        56928     27306.67
    3563.519     0.999969        56929     32768.00
    3563.519     0.999973        56929     36408.89
    3563.519     0.999976        56929     40960.00
    3563.519     0.999979        56929     46811.43
    3563.519     0.999982        56929     54613.33
    3692.543     0.999985        56930     65536.00
    3692.543     1.000000        56930          inf
#[Mean    =      252.101, StdDeviation   =      236.485]
#[Max     =     3690.496, Total count    =        56930]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57417 requests in 20.00m, 16.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 21211
  Non-2xx or 3xx responses: 16
Requests/sec:     47.84  
Transfer/sec:     14.05KB